case_up_half_cube_25/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.001);

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    top
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    bottom
    {
        type            noSlip;
    }
    front
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    back
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
    source
    {
        // Single-stage ramp: 0 → 800 m/s over 0.4 s (slope = 2000 m/s²).
        // k and epsilon tables in 0.orig/k and 0.orig/epsilon are synchronised
        // to this ramp (values computed for I=0.05, L=2.807e-3 m, nozzle=40.1 mm).
        // If T drops below 200 K, extend ramp to 0.6–0.8 s.
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    (0 0 0))
            (0.4    (0 0 800))
            (100.0  (0 0 800))
        );
        value           uniform (0 0 0);
    }
    nozzle_wall_rest
    {
        type            noSlip;
    }
}


// ************************************************************************* //
