case_up_half_cube_25/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-05;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 3.75e-05;
    }
    front
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    back
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 3.75e-05;
    }
    source
    {
        // Explicit table synchronised with U ramp in 0.orig/U.
        // k = 1.5*(I*U)^2, I=0.05, nozzle=40.1 mm:
        //   U=  0 m/s → ambient floor (keeps k-eps solver stable at startup)
        //   U=800 m/s → k = 2400 m²/s²
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    3.75e-05)
            (0.4    2400)
            (100.0  2400)
        );
        value           uniform 3.75e-05;
    }
    nozzle_wall_rest
    {
        type            kqRWallFunction;
        value           uniform 3.75e-05;
    }
}


// ************************************************************************* //
