case_up_half_cube_25/Allrun
#!/bin/sh

#cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

#cp \
#    $FOAM_TUTORIALS/resources/geometry/membrane-boundaries.stl.gz \
#    $FOAM_TUTORIALS/resources/geometry/membrane-membrane.stl.gz \
#    constant/triSurface
cp -r 0.orig/ 0/
runApplication -s nozzle surfaceTransformPoints -scale "(0.001 0.001 0.001)" constant/triSurface/nozzle.stl \
    constant/triSurface/nozzle_m.stl
runApplication -s V_room surfaceTransformPoints -scale "(0.001 0.001 0.001)" constant/triSurface/V_room.stl \
    constant/triSurface/V_room_m.stl
runApplication surfaceFeatureExtract
runApplication blockMesh
runApplication snappyHexMesh -overwrite
rm 0/cellLevel 0/pointLevel
runApplication topoSet 
runApplication createPatch -overwrite
runApplication checkMesh
runApplication renumberMesh -overwrite
touch open.foam
#runApplication potentialFoam  # disabled: potentialFoam causes phi runaway at H2/air interface
#replace the gamma 
#sed -i '38s/gamma           1;/gamma           1.4;/' 0/p
#restore0Dir

#runApplication setFields

#runApplication reactingFoam

#------------------------------------------------------------------------------
